allPosts.org
#+HUGO_BASE_DIR: ./
#+TITLE: Ian Hocking

** TODO Blogging with Emacs, Hugo and Org Mode                       :setup:
:PROPERTIES:
:EXPORT_FILE_NAME: settingUpBlog
:EXPORT_DATE: 2019-09-01
:END:

This blog is brand--not to say spanking--new. For a while, this summer, I was in
the process of transitioning out of my current role (a story another time), I
was thinking about updating my web presence. Not that I don't have one. I've
been on the [[https://twitter.com/ian_hocking?lang=en-gb][the Twitter]] and Facebook for a long old time, and my blog dates back
to [[http://ianhocking.com/2003/02/heres-email-from-my-dad-that-i-just.html][2003]]. But my online identity focused mainly my fiction writing. I want to change its
focus to coding, which, I hope, is the direction in which I'm now
heading.

Like James May in [[https://www.youtube.com/watch?v=77BG4qkviWc][the Reassembler]], I want to slowly take this blog apart and put
it back together again.

My first tool is [[https://www.gnu.org/software/emacs/][Emacs]][fn:emacs], free software dating from the 1970s. I came to
Emacs from [[https://www.vim.org][Vim]]. I've written elsewhere about my preference for text-based (i.e.
non-GUI) tools, and I have an idea for a post to this blog where I talk about my
current Emacs setup.

Next is a static website generation framework called [[https://gohugo.io][Hugo]]. A key aim of the Hugo
project is that sites are pre-compiled. The server need only offer HTML, and
very little in-the-moment calculation happens on the server or the browser. This
means small, fast websites. Hugo has an active theming community, too. It never
ceases to amaze me that folks around the world are willing to offer their time
to such projects--not just the themes, of course, but the Hugo project itself.

Last, I'll be leaning heavily on [[https://orgmode.org][org-mode]], a part of Emacs that started as a
fancy outlining framework but became a wonderful system for storing, organising
and exporting information. Contributors have created adjuncts to org-mode, and
one such is ox-hugo[fn:oxhugo]

*** Org Mode Blogging Solutions







[fn:emacs] GNU Emacs 26.2, running on macOS 10.14.6.


[fn:oxhugo] I believe the ~ox~ part stands for org export.


*** Emacs

- Auto export

*** Org Mode

- Literate coding

*** Static Speed

*** Installation


*** My Old Blog

- It's still there
  - .htaccess issues

*** Tags

- Probably don't need them
